#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-02-29T10:56:50.303+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "C44mRFyQVFgHXaWUs1DEaI5bS/WmLukzU3aSVLay45E=" -> (known after apply)
        source_code_size               = 915
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_POST_URL" = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-otg.data.archive_file.aws_lambda_otg will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_otg"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-otg/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-otg/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-otg.aws_api_gateway_integration.aws_lambda_otg will be created
  + resource "aws_api_gateway_integration" "aws_lambda_otg" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.aws-lambda-otg.aws_api_gateway_method.aws_lambda_otg will be created
  + resource "aws_api_gateway_method" "aws_lambda_otg" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.aws-lambda-otg.aws_api_gateway_resource.aws_lambda_otg will be created
  + resource "aws_api_gateway_resource" "aws_lambda_otg" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "aws_lambda_otg"
      + rest_api_id = (known after apply)
    }

  # module.aws-lambda-otg.aws_api_gateway_rest_api.aws_lambda_otg will be created
  + resource "aws_api_gateway_rest_api" "aws_lambda_otg" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "myapi"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.aws-lambda-otg.aws_iam_role.aws_lambda_otg will be created
  + resource "aws_iam_role" "aws_lambda_otg" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-lambda-cost"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.aws-lambda-otg.aws_lambda_function.aws_lambda_otg will be created
  + resource "aws_lambda_function" "aws_lambda_otg" {
      + arn                            = (known after apply)
      + filename                       = "modules/aws-lambda-otg/lambda.zip"
      + function_name                  = "aws-lambda-cost"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LINE_NOTIFY_TOKEN" = "E5wMLhCmVvsmaYqf8AVezO1O5pySN8cG6LbbaYOUdi8"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.aws-lambda-otg.aws_lambda_permission.aws_lambda_otg will be created
  + resource "aws_lambda_permission" "aws_lambda_otg" {
      + action        = "lambda:InvokeFunction"
      + function_name = "aws-lambda-cost"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.aws-lambda-otg.null_resource.aws_lambda_otg will be created
  + resource "null_resource" "aws_lambda_otg" {
      + id       = (known after apply)
      + triggers = {
          + "source_code_hash" = "0hnQkWLbI7T2ckvO6tBA3oa6J2TcDpNl5tos3FXKcXo="
        }
    }

Plan: 8 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
